import { Component } from '@angular/core';
import { first } from 'rxjs';

@Component({
  selector: 'app-card',
  templateUrl: './card.component.html',
  styleUrls: ['./card.component.css']
})
export class CardComponent {
  cards = [
    {id:1, header: "Тестування мобільного застосунку Family Game Night", content: "Застосунок зможе повідомити про перші сигнали деменції, а також...", image: "assets/img/image1.png" },
    {id:2, header: "Прем'єра вистави 'Батько' за п'єсою Флоріана Зеллера", content: "В рамках вистави фонд разом із фотографинею Анастасією Накорнєєвою предтавив 'МИ Є ЛЮДИ з деменцією'.", image: "assets/img/image2.png" },
    {id:3, header: "FDA схвалили препарат Адуканумаб", content: "Це перші в історії ліки, які потенційно можуть відтермінувати розвиток деменції. Препрати, які використовуються зараз...", image: "assets/img/image3.png" },
    {id:4, header: "FDA схвалили препарат Адуканумаб", content: "Це перші в історії ліки, які потенційно можуть відтермінувати розвиток деменції. Препрати, які використовуються зараз...", image: "assets/img/image4.png" },
    {id:5, header: "Тестування мобільного застосунку Family Game Night", content: "Застосунок зможе повідомити про перші сигнали деменції, а також...", image: "assets/img/image5.png" },
    {id:6, header: "Прем'єра вистави 'Батько' за п'єсою Флоріана Зеллера", content: "В рамках вистави фонд разом із фотографинею Анастасією Накорнєєвою предтавив 'МИ Є ЛЮДИ з деменцією'.", image: "assets/img/image6.png" },
    {id:7, header: "Прем'єра вистави 'Батько' за п'єсою Флоріана Зеллера", content: "В рамках вистави фонд разом із фотографинею Анастасією Накорнєєвою предтавив 'МИ Є ЛЮДИ з деменцією'.", image: "assets/img/image7.png" },
    {id:8, header: "FDA схвалили препарат Адуканумаб", content: "Це перші в історії ліки, які потенційно можуть відтермінувати розвиток деменції. Препрати, які використовуються зараз...", image: "assets/img/image8.png" },
    {id:9, header: "Тестування мобільного застосунку Family Game Night", content: "Застосунок зможе повідомити про перші сигнали деменції, а також...", image: "assets/img/image9.png" },
  ]
}
